Feature: Login feature
  За да се разбере дали системата се позлва от слижутел е необходимо служителя
  да се логне с предварително регистриран профил

  Scenario: Влизане в системата с валидни потребителски данни
    Given Потребителя се намира на начален екран
    And Натиска бутон за вход в системата
    And Отваря се попъп за вход в системата
    When Въведе валидно потребителско име
    And въведе валидна парола
    And Натисне на бутона за вход в системата
    Then Показва се съобщение "Влязохте в системата"

  Scenario: Влизане в системата с невалидни потребителски данни
    Given Потребителя се намира на начален екран
    And Натиска бутон за вход в системата
    And Отваря се попъп за вход в системата
    When Въведе невалидно потребителско име
    And въведе невалидна парола
    And Натисне на бутона за вход в системата
    Then Показва се съобщение "Грешни данни"

  Scenario: Влизане в системата само с парола
    Given Потребителя се намира на начален екран
    And Натиска бутон за вход в системата
    And Отваря се попъп за вход в системата
    When въведе валидна парола
    And Натисне на бутона за вход в системата
    Then Показва се съобщение "Попълнете всички задължителни полета"

  Scenario: Влизане в системата само с потребителско име
    Given Потребителя се намира на начален екран
    And Натиска бутон за вход в системата
    And Отваря се попъп за вход в системата
    When Въведе валидно потребителско име
    And Натисне на бутона за вход в системата
    Then Показва се съобщение "Попълнете всички задължителни полета"

  Scenario: Влизане в системата без потребителско име и парола
    Given Потребителя се намира на начален екран
    And Натиска бутон за вход в системата
    And Отваря се попъп за вход в системата
    When Натисне на бутона за вход в системата
    Then Показва се съобщение "Попълнете всички задължителни полета"
